content/assignments/week2.md
+++
title = "Spinoza I: Substance & Explanation"
publishDate = 2022-09-01T00:00:00-04:00
tags = ["aquinas", "causality", "descartes", "explanation", "spinoza", "substance", "psr"]
draft = false
weight = -100
author = false
toc = false
type = "post"
+++

This week we look at Spinoza&rsquo;s view of substance and its connection to one or another variety of the PSR. Among the questions we&rsquo;ll be asking are the following: Does Spinoza endorse a version of the PSR? What role, if any, does it play in his monism argument? How is any version of the PSR related to his overall project in _Ethics_ I? In what sense, if any, does Spinoza consider God/nature to be &ldquo;self-caused&rdquo;? How is his view of the causal-explanatory status of God different from that of Aquinas or Descartes?

-   [Discussion thread](https://discord.com/channels/1006739669842673674/1011720581139410995)
-   Notes (coming soon)


## Readings {#readings}

-   Descartes: _Principles of Philosophy_, [Part I, §51–64](/materials/readings/descartes-principles-I.pdf)
-   Spinoza: _Ethics_, [part I](/materials/readings/spinoza-ethics-I.pdf)


## Recommended {#recommended}

-   Della Rocca: _Spinoza_, [ch. 2](/materials/readings/dellarocca-ch2.pdf).
-   Melamed: &ldquo;[Spinoza on Causa Sui](/materials/readings/melamed-causa-sui.pdf)&rdquo;
-   Lin: &ldquo;[The Principle of Sufficient Reason in Spinoza](/materials/readings/lin-psr-spinoza.pdf)&rdquo;
